Repository: JoaoVLima/AulasAPI
Catalog: locale/*/LC_MESSAGES/django.po
Languages: pt_br

source: Successfully retrieved instance by id
pt_br: Instância recuperada com sucesso pelo ID

source: Failed to get instance by id
pt_br: Falha ao recuperar instância pelo ID

source: Instance not found
pt_br: Instância não encontrada

source: Successfully retrieved active instances
pt_br: Instâncias ativas recuperadas com sucesso

source: Failed to get active instances
pt_br: Falha ao recuperar instâncias ativas

source: Successfully retrieved all instances
pt_br: Todas as instâncias recuperadas com sucesso

source: Failed to get all instances
pt_br: Falha ao recuperar todas as instâncias

source: Successfully created instance
pt_br: Instância criada com sucesso

source: Failed to create instance
pt_br: Falha ao criar instância

source: Successfully updated instance
pt_br: Instância atualizada com sucesso

source: Failed to update instance
pt_br: Falha ao atualizar instância

source: Successfully deleted instance
pt_br: Instância deletada com sucesso

source: Failed to delete instance
pt_br: Falha ao deletar instância

source: Successfully force deleted instance
pt_br: Instância forçada a ser deletada com sucesso

source: Failed to force delete instance
pt_br: Falha ao forçar deletação da instância

source: The GrandeBIAPI is a backend project developed to power the GrandeBI system, which is a Business Intelligence (BI) platform. The API is the heart of the system, responsible for collecting, processing, and providing data to the frontend, enabling the generation of reports, dashboards, and strategic analyses.
pt_br: O GrandeBIAPI é um projeto de backend desenvolvido para alimentar o sistema GrandeBI, que é uma plataforma de Business Intelligence (BI). A API é o coração do sistema, responsável por coletar, processar e disponibilizar dados para o frontend, permitindo a geração de relatórios, dashboards e análises estratégicas.

source: Successfully retrieved dashboard data
pt_br: Dados do dashboard recuperados com sucesso

source: Failed to get dashboard data
pt_br: Falha ao recuperar dados do dashboard
